Repository: CofficLab/GitOK
Catalog: Packages/PluginGitIgnore/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add patterns to .gitignore.
zh_hans: 向 .gitignore 添加模式。
zh_hk: 向 .gitignore 添加模式。

source: Close
zh_hans: 关闭
zh_hk: 關閉

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Edit rules
zh_hans: 编辑规则
zh_hk: 編輯規則

source: Evaluate
zh_hans: 评估
zh_hk: 評估

source: Git Ignore
zh_hans: Git 忽略
zh_hk: Git 忽略

source: Git re-reads the rules against the working tree.
zh_hans: git 重新对照工作树读取规则。
zh_hk: git 重新對照工作樹讀取規則。

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Keep noise out of your repository, effortlessly.
zh_hans: 轻松把噪音挡在仓库之外。
zh_hk: 輕鬆把噪音擋在倉庫之外。

source: Live Preview
zh_hans: 实时预览
zh_hk: 實時預覽

source: Live preview
zh_hans: 实时预览
zh_hk: 實時預覽

source: Matching files disappear from untracked status.
zh_hans: 匹配的文件从未跟踪状态中消失。
zh_hk: 匹配的文件從未跟蹤狀態中消失。

source: Nested Rules
zh_hans: 嵌套规则
zh_hk: 嵌套規則

source: No .gitignore file found
zh_hans: 未找到 .gitignore 文件
zh_hk: 找不到 .gitignore 檔案

source: Per-path
zh_hans: 按路径
zh_hk: 按路徑

source: Repo-level and global ignore rules are respected together.
zh_hans: 仓库级与全局忽略规则共同生效。
zh_hk: 倉庫級與全局忽略規則共同生效。

source: See which files would be ignored as you edit the rules.
zh_hans: 编辑规则时实时预览哪些文件将被忽略。
zh_hk: 編輯規則時實時預覽哪些文件將被忽略。

source: Start from curated templates for common languages and tools.
zh_hans: 从精选的常用语言与工具模板起步。
zh_hk: 從精選的常用語言與工具模板起步。

source: Stay clean
zh_hans: 保持整洁
zh_hk: 保持整潔

source: Template Library
zh_hans: 模板库
zh_hk: 模板庫

source: Templates
zh_hans: 模板
zh_hk: 模板

source: View .gitignore file
zh_hans: 查看 .gitignore 文件
zh_hk: 檢視 .gitignore 檔案

source: file to rule them
zh_hans: 一份规则文件
zh_hk: 一份規則文件

source: templates
zh_hans: 模板数
zh_hk: 模板數
